app/controllers/blogs_controller.rb

SELECT COUNT(*) FROM "blogs"
SELECT "blogs".* FROM "blogs"
---
  def index
    if logged_in?(:site_admin)
      @blogs = Blog.recent.page(params[:page]).per(5)

SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    if logged_in?(:site_admin) || @blog.published?
      @blog = Blog.includes(:comments).friendly.find(params[:id])

INSERT INTO "blogs" ("title", "body", "created_at", "updated_at", "slug") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "sdfgfdg"], ["body", "dsgdshsg"], ["created_at", "2019-02-14 04:49:24.404259"], ["updated_at", "2019-02-14 04:49:24.404259"], ["slug", "sdfgfdg"]]
---
  def create
    @blog = Blog.new(blog_params)

    respond_to do |format|
      if @blog.save

UPDATE "blogs" SET "status" = $1, "updated_at" = $2 WHERE "blogs"."id" = $3  [["status", 1], ["updated_at", "2019-02-21 02:57:05.491072"], ["id", 10]]
---
  def update
    respond_to do |format|
      if @blog.update(blog_params)