app/controllers/blogs_controller.rb

  def create
    @blog = Blog.new(blog_params)

    respond_to do |format|
      if @blog.save
---
INSERT INTO "blogs" ("title", "body", "created_at", "updated_at", "slug") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "sadgsgasg"], ["body", "fgdfgsafdsf"], ["created_at", "2019-01-23 09:22:36.267081"], ["updated_at", "2019-01-23 09:22:36.267081"], ["slug", "sadgsgasg"]]