app/controllers/pages_controller.rb

SELECT "skills".* FROM "skills"
---
  def about
    @skills = Skill.all