app/controllers/portfolios_controller.rb

    def index
        @portfolio_items = Portfolio.where(subtitle: 'Angular')
---
SELECT "portfolios".* FROM "portfolios" WHERE "portfolios"."subtitle" = $1  [["subtitle", "Angular"]]